agrondpham/lpc1764-sdcard/Source/SPI/MMC_SD.C
    //开始准备数据传输
    SD_CS(0);
    //先放3个空数据，等待SD卡准备好
    ssp0_send(0xff);
    ssp0_send(0xff);
    ssp0_send(0xff);
    //放起始令牌0xFE
    ssp0_send(0xFE);

    //放一个sector的数据
    for(i=0;i<512;i++)
    {
        ssp0_send(*data++);
    }
    //发2个Byte的dummy CRC
    ssp0_send(0xff);
    ssp0_send(0xff);
    
    //等待SD卡应答
    r1 = ssp0_send(0xff);
    if((r1&0x1F)!=0x05)
    {
        SD_CS(1);
        return r1;
    }
    
    //等待操作完成
    retry = 0;
    while(!ssp0_send(0xff))
    {
        retry++;
        if(retry>0xfffe)        //如果长时间写入没有完成，报错退出
        {
            SD_CS(1);
            return 1;           //写入超时返回1
        }
    }	    
    //写入完成，片选置1
    SD_CS(1);
    ssp0_send(0xff);

    return 0;
}
/************************************************************************																										
** 函数功能: 读SD卡的多个block(实际测试过) 
** 入口参数: 输入:u32 sector 扇区地址（sector值，非物理地址）
**			 u8 *buffer 数据存储地址（大小至少512byte）
**			 u8 count 连续读count个block
** 出口参数: 0： 成功
**			 other：失败
** 备    注: 无
************************************************************************/															  
u8 SD_ReadMultiBlock(u32 sector, u8 *buffer, u8 count)
{
    u8 r1;	 			 
    //SPIx_SetSpeed(SPI_SPEED_HIGH);//设置为高速模式  
 	//如果不是SDHC，将sector地址转成byte地址
    if(SD_Type!=SD_TYPE_V2HC)sector = sector<<9;  
    //SD_WaitDataReady();
    //发读多块命令
	r1 = SD_SendCommand(CMD18, sector, 0);//读命令
	if(r1 != 0x00)return r1;	 
    do//开始接收数据
    {
        if(SD_ReceiveData(buffer, 512, NO_RELEASE) != 0x00)break; 
        buffer += 512;
    } while(--count);		 
    //全部传输完毕，发送停止命令
    SD_SendCommand(CMD12, 0, 0);
    //释放总线
    SD_CS(1);
    ssp0_send(0xFF);    
    if(count != 0)return count;   //如果没有传完，返回剩余个数	 
    else return 0;	 
}		
/************************************************************************																										
** 函数功能: 写入SD卡的N个block(未实际测试过) 
** 入口参数: u32 sector 扇区地址（sector值，非物理地址）
**			 u8 *buffer 数据存储地址（大小至少512byte）
**			 u8 count 写入的block数目
** 出口参数: 0： 成功
**			 other：失败
** 备    注: 无
************************************************************************/															   
u8 SD_WriteMultiBlock(u32 sector, const u8 *data, u8 count)
{
    u8 r1;
    u16 i;	 		 
    //SPIx_SetSpeed(SPI_SPEED_HIGH);//设置为高速模式	 
    if(SD_Type != SD_TYPE_V2HC)sector = sector<<9;//如果不是SDHC，给定的是sector地址，将其转换成byte地址  
    if(SD_Type != SD_TYPE_MMC) r1 = SD_SendCommand(ACMD23, count, 0x00);//如果目标卡不是MMC卡，启用ACMD23指令使能预擦除   
    r1 = SD_SendCommand(CMD25, sector, 0x00);//发多块写入指令
    if(r1 != 0x00)return r1;  //应答不正确，直接返回	 
    SD_CS(0);//开始准备数据传输   
    ssp0_send(0xff);//先放3个空数据，等待SD卡准备好
    ssp0_send(0xff);   
    //--------下面是N个sector写入的循环部分
    do
    {
        //放起始令牌0xFC 表明是多块写入
        ssp0_send(0xFC);	  
        //放一个sector的数据
        for(i=0;i<512;i++)
        {
            ssp0_send(*data++);
        }
        //发2个Byte的dummy CRC
        ssp0_send(0xff);
        ssp0_send(0xff);
        
        //等待SD卡应答
        r1 = ssp0_send(0xff);
        if((r1&0x1F)!=0x05)
        {
            SD_CS(1);    //如果应答为报错，则带错误代码直接退出
            return r1;
        }		   
        //等待SD卡写入完成
        if(SD_WaitDataReady()==1)
        {
            SD_CS(1);    //等待SD卡写入完成超时，直接退出报错
            return 1;
        }	   
    }while(--count);//本sector数据传输完成  
    //发结束传输令牌0xFD
    r1 = ssp0_send(0xFD);
    if(r1==0x00)
    {
        count =  0xfe;
    }		   
    if(SD_WaitDataReady()) //等待准备好
	{
		SD_CS(1);
		return 1;  
	}
    //写入完成，片选置1
    SD_CS(1);
    ssp0_send(0xff);  
    return count;   //返回count值，如果写完则count=0，否则count=1
}
/************************************************************************																										
** 函数功能: 在指定扇区,从offset开始读出bytes个字节 
** 入口参数: u32 sector 扇区地址（sector值，非物理地址）
**			 u8 *buf     数据存储地址（大小<=512byte）
**			 u16 offset  在扇区里面的偏移量
**			 u16 bytes   要读出的字节数
** 出口参数: 0： 成功
**			 other：失败
** 备    注: 无
************************************************************************/															   
u8 SD_Read_Bytes(unsigned long address,unsigned char *buf,unsigned int offset,unsigned int bytes)
{
    u8 r1;u16 i=0;  
    r1=SD_SendCommand(CMD17,address<<9,0);//发送读扇区命令      
    if(r1)return r1;  //应答不正确，直接返回
	SD_CS(0);//选中SD卡
	if(SD_GetResponse(0xFE))//等待SD卡发回数据起始令牌0xFE
	{
		SD_CS(1); //关闭SD卡
		return 1;//读取失败
	}	 
	for(i=0;i<offset;i++)ssp0_send(0xff);//跳过offset位 
    for(;i<offset+bytes;i++)*buf++=ssp0_send(0xff);//读取有用数据	
    for(;i<512;i++) ssp0_send(0xff); 	 //读出剩余字节
    ssp0_send(0xff);//发送伪CRC码
    ssp0_send(0xff);  
    SD_CS(1);//关闭SD卡
	return 0;
}



